results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps1000-batch131072-acks1-prod12-compnone-trial3/producer-perf-11.log
producer_index=11
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.00 MB/sec), 2353.0 ms avg latency, 2353.0 ms max latency.
696 records sent, 134.9 records/sec (1.32 MB/sec), 5549.6 ms avg latency, 15048.0 ms max latency.
1408 records sent, 280.0 records/sec (2.73 MB/sec), 5127.4 ms avg latency, 9574.0 ms max latency.
419 records sent, 83.7 records/sec (0.82 MB/sec), 36.5 ms avg latency, 91.0 ms max latency.
419 records sent, 83.4 records/sec (0.81 MB/sec), 22.1 ms avg latency, 86.0 ms max latency.
415 records sent, 82.8 records/sec (0.81 MB/sec), 17.0 ms avg latency, 55.0 ms max latency.
417 records sent, 83.3 records/sec (0.81 MB/sec), 15.3 ms avg latency, 33.0 ms max latency.
418 records sent, 83.3 records/sec (0.81 MB/sec), 13.7 ms avg latency, 33.0 ms max latency.
416 records sent, 82.9 records/sec (0.81 MB/sec), 13.5 ms avg latency, 31.0 ms max latency.
416 records sent, 83.2 records/sec (0.81 MB/sec), 13.4 ms avg latency, 45.0 ms max latency.
416 records sent, 83.2 records/sec (0.81 MB/sec), 14.5 ms avg latency, 43.0 ms max latency.
417 records sent, 83.1 records/sec (0.81 MB/sec), 13.1 ms avg latency, 31.0 ms max latency.
416 records sent, 83.1 records/sec (0.81 MB/sec), 12.6 ms avg latency, 65.0 ms max latency.
416 records sent, 83.1 records/sec (0.81 MB/sec), 12.3 ms avg latency, 27.0 ms max latency.
416 records sent, 83.1 records/sec (0.81 MB/sec), 11.6 ms avg latency, 25.0 ms max latency.
416 records sent, 83.0 records/sec (0.81 MB/sec), 12.7 ms avg latency, 25.0 ms max latency.
415 records sent, 83.0 records/sec (0.81 MB/sec), 11.7 ms avg latency, 45.0 ms max latency.
8333 records sent, 82.893153 records/sec (0.81 MB/sec), 1341.68 ms avg latency, 15048.00 ms max latency, 16 ms 50th, 7154 ms 95th, 8589 ms 99th, 9574 ms 99.9th.